#+TITLE: VRP solver environment
#+AUTHOR: Fernando Rodriguez Flores
#+DATE 2018-07-29 
#+TAGS: suite(s) classes(c) moments(m) data(d) algoritms(a) dcost(v)
#+TAGS: emacs(e) utils(u) strat(t) simul(i) vanny(o) initialroutes(r)
#+TAGS: hector(h)
#+TODO: TODO | DONE
#+STARTUP: nologdone


** <2024-06-19 Wed>
:LOGBOOK:
CLOCK: [2024-06-19 Wed 11:40]--[2024-06-19 Wed 12:05] =>  0:25
:END:
 - in neighborhood rarab21b12
   - added a function to detect whether c2 was selected before c1 
** <2023-08-13 Sun>
:LOGBOOK:
CLOCK: [2023-08-13 Sun 20:54]--[2023-08-13 Sun 21:32] =>  0:38
:END:
 - write the macro for the pattern detection
 - tested the macro
** <2023-08-12 Sat>
:LOGBOOK:
CLOCK: [2023-08-12 Sat 19:24]--[2023-08-12 Sat 19:32] =>  0:08
:END:
 - modify the document structure for the pattern-dectection functions and macros
 - that's on the file vrp-strategy
** <2023-08-01 Tue>
:LOGBOOK:
CLOCK: [2023-08-01 Tue 21:41]--[2023-08-01 Tue 23:55] =>  2:14
CLOCK: [2023-08-01 Tue 18:20]--[2023-08-01 Tue 20:27] =>  2:07
:END:
 - writing the difference
 - testing the difference
 - found bug in the computation of the difference
 - thinking about the solution to the elimination of some neighbors
 - the next steps should be create the next identify pattern functions
 - decided, those would be the next steps
** <2023-07-28 Fri>
:LOGBOOK:
CLOCK: [2023-07-28 Fri 17:28]--[2023-07-28 Fri 18:53] =>  1:25
:END:
 - analyzing repeating solutions
 - I think I have an idea of what's going on
 - solved one of the problems.
 - the next step is to compute the difference between two tries
** <2023-07-15 Sat>
:LOGBOOK:
CLOCK: [2023-07-15 Sat 22:33]--[2023-07-16 Sun 00:44] =>  2:11
:END: 
 - working on removing elements from hermen example
 - wrote some functions to explore the trie
 - next ideas:
   - write a function to detect patterns in the trie
     - for instance: show unique solutions with this pattern
       - this should be done in the trie with the original solutions
** <2023-07-10 Mon>
:LOGBOOK:
CLOCK: [2023-07-10 Mon 19:32]--[2023-07-10 Mon 20:46] =>  1:14
:END:
 - adding constraints to criteria in hermen example
 - had to write the example from scratch using the do-neighborhood macros
** <2023-07-08 Sat>
:LOGBOOK:
CLOCK: [2023-07-08 Sat 21:41]--[2023-07-08 Sat 23:16] =>  1:35
CLOCK: [2023-07-08 Sat 15:44]--[2023-07-08 Sat 19:10] =>  3:26
:END:
 - Added a program to detect repeated neighbors in a criterion.
 - added a strategy for that.
 - adding examples to detect repeated elements
 - write a function to analyze a neighborhood for a solution
 - write some examples for hermen
** <2022-04-14 Thu>
:LOGBOOK:
CLOCK: [2022-04-14 Thu 11:56]--[2022-04-14 Thu 12:29] =>  0:33
:END:
 - added how to modify a solution with a working copy.
** <2022-04-13 Wed>
:LOGBOOK:
CLOCK: [2022-04-13 Wed 11:02]--[2022-04-13 Wed 11:35] =>  0:33
:END:
** <2022-04-12 Tue>
:LOGBOOK:
CLOCK: [2022-04-12 Tue 11:35]--[2022-04-12 Tue 11:54] =>  0:19
:END:
** <2022-03-27 Sun>
:LOGBOOK:
CLOCK: [2022-03-27 Sun 14:00]--[2022-03-27 Sun 14:44] =>  0:44
:END:
** <2021-08-27 Fri>
   :LOGBOOK:
   CLOCK: [2021-08-27 Fri 11:10]--[2021-08-27 Fri 11:43] =>  0:33
   :END:
** <2021-08-24 Tue>
   :LOGBOOK:
   CLOCK: [2021-08-24 Tue 11:07]--[2021-08-24 Tue 11:37] =>  0:30
   :END:
** <2021-03-17 mié>
   :LOGBOOK:
   CLOCK: [2021-03-17 mié 17:41]--[2021-03-17 mié 18:30] =>  0:49
   :END:
** <2021-01-26 mar>
   :LOGBOOK:
   CLOCK: [2021-01-26 mar 17:40]--[2021-01-26 mar 18:35] =>  0:55
   :END:
** <2021-01-22 vie>
   :LOGBOOK:
   CLOCK: [2021-01-22 vie 14:25]--[2021-01-22 vie 15:30] =>  1:05
   :END:
** <2021-01-21 jue>
   :LOGBOOK:
   CLOCK: [2021-01-21 jue 16:26]--[2021-01-21 jue 17:58] =>  1:32
   :END:
** <2021-01-20 mié>
   :LOGBOOK:
   CLOCK: [2021-01-20 mié 16:55]--[2021-01-20 mié 17:50] =>  0:55
   :END:
** <2021-01-19 mar>
   :LOGBOOK:
   CLOCK: [2021-01-19 mar 17:05]--[2021-01-19 mar 17:18] =>  0:13
   :END:
** <2021-01-18 lun>
   :LOGBOOK:
   CLOCK: [2021-01-18 lun 17:19]--[2021-01-18 lun 18:19] =>  1:00
   :END:
** <2021-01-11 lun>
   :LOGBOOK:
   CLOCK: [2021-01-11 lun 15:35]--[2021-01-11 lun 16:28] =>  0:53
   CLOCK: [2021-01-11 lun 14:09]--[2021-01-11 lun 14:34] =>  0:25
   :END:
** <2021-01-10 dom>
   :LOGBOOK:
   CLOCK: [2021-01-10 dom 17:11]--[2021-01-10 dom 18:52] =>  1:41
   :END:
** <2021-01-05 mar>
   :LOGBOOK:
   CLOCK: [2021-01-05 mar 11:07]--[2021-01-05 mar 13:22] =>  2:15
   :END:
** <2021-01-03 dom>
   :LOGBOOK:
   CLOCK: [2021-01-03 dom 16:25]--[2021-01-03 dom 17:05] =>  0:40
   CLOCK: [2021-01-03 dom 16:05]--[2021-01-03 dom 16:25] =>  0:20
   :END:
** <2021-01-02 sáb>
   :LOGBOOK:
   CLOCK: [2021-01-02 sáb 15:05]--[2021-01-02 sáb 15:50] =>  0:45
   :END:
** <2021-01-01 vie>
   :LOGBOOK:
   CLOCK: [2021-01-01 vie 17:27]--[2021-01-01 vie 17:58] =>  0:31
   :END:
** <2020-12-31 jue>
   :LOGBOOK:
   CLOCK: [2020-12-31 jue 16:03]--[2020-12-31 jue 16:32] =>  0:29
   :END:
** <2020-12-29 mar>
   :LOGBOOK:
   CLOCK: [2020-12-29 mar 18:06]--[2020-12-29 mar 18:08] =>  0:02
   CLOCK: [2020-12-29 mar 18:06]--[2020-12-29 mar 18:06] =>  0:00
   CLOCK: [2020-12-29 mar 18:05]--[2020-12-29 mar 18:06] =>  0:01
   CLOCK: [2020-12-29 mar 16:32]--[2020-12-29 mar 17:22] =>  0:50
   :END:
** <2020-12-28 lun>
   :LOGBOOK:
   CLOCK: [2020-12-28 lun 14:43]--[2020-12-28 lun 15:20] =>  0:37
   CLOCK: [2020-12-28 lun 14:12]--[2020-12-28 lun 14:43] =>  0:31
   :END:
** <2020-12-27 dom>
   :LOGBOOK:
   CLOCK: [2020-12-27 dom 15:25]--[2020-12-27 dom 17:35] =>  2:10
   :END:
